recept/src/DataProcessors/ТабличныйКонструкторРецептур/ТабличныйКонструкторРецептур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТабличныйКонструкторРецептур</name>
</mdclass:DataProcessor>

recept/src/Documents/Рецепт/Рецепт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Рецепт</name>
  <registerRecords>InformationRegister.Рецепт</registerRecords>
  <registerRecords>AccumulationRegister.СоставРецептур</registerRecords>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимостьПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Переработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Загрузка4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагрузкаИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Компонент4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомпонентСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.НоменклатураМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоНаТонну</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияЗагрузки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

recept/src/DataProcessors/ТабличныйКонструкторРецептур/Forms/ПодборРецептур/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокРецептур.Очистить();
	ЗаполнитьСписокРецептурНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Команда сравнения рецептур
&НаКлиенте
Процедура Сравнить(Команда)
	
	МассивРецептур = Новый Массив;
	
	Для Каждого Строка Из СписокРецептур Цикл
		Если Строка.Выбрать Тогда
			МассивРецептур.Добавить(Строка.Рецептура);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивРецептур.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Не выбраны рецептуры для сравнения.");
		Возврат;
	КонецЕсли;
	
	//ДанныеСравнения = СравнитьНаСервере(МассивРецептур);
	
	//ПараметрыФормы = Новый Структура("ДанныеСравнения", ДанныеСравнения);
	ПараметрыФормы = Новый Структура("СписокРецептур", МассивРецептур);	
		
	ОткрытьФорму("Обработка.ТабличныйКонструкторРецептур.Форма.ФормаСравненияРецептур", ПараметрыФормы, ЭтотОбъект);
	
	//ЭтотОбъект.Закрыть();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Заполняет список рецептур на сервере.
//
&НаСервере
Процедура ЗаполнитьСписокРецептурНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рецепт.Ссылка КАК Рецептура,
		|	Рецепт.Наименование КАК Наименование
		|ИЗ
		|	Документ.Рецепт КАК Рецепт
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Если структура колонок результата запроса совпадает с колонками таблицы формы,
	// метод Загрузить заполнит их автоматически.
	// Значения колонок, не указанные в запросе (например, "Выбрать"), 
	// будут заполнены значениями по умолчанию.
	СписокРецептур.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры


&НаСервере
Функция СравнитьНаСервере(МассивРецептур)
	
	МассивПорядкаРецептур = Новый Массив;
	МассивПорядкаКомпонентов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рецепт.Наименование КАК Наименование,
		|	Рецепт.Ссылка,
		|	РецептСостав.Материал,
		|	РецептСостав.Материал.Наименование КАК МатериалНаименование,
		|	РецептСостав.КоличествоНаТонну
		|ИЗ
		|	Документ.Рецепт КАК Рецепт
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рецепт.Состав КАК РецептСостав
		|		ПО РецептСостав.Ссылка = Рецепт.Ссылка
		|ГДЕ
		|	Рецепт.Ссылка В (&Список)
		|
		|УПОРЯДОЧИТЬ ПО
		|	МатериалНаименование";
	
	Запрос.УстановитьПараметр("Список", МассивРецептур);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТаблицаКомпонентов = Новый Соответствие;
	Рецептуры = Новый Соответствие;
	
	//Список рецептур (для колонок)
	Пока Выборка.Следующий() Цикл
		
		Если Рецептуры.Получить(Выборка.Ссылка) = Неопределено Тогда
			Рецептуры.Вставить(Выборка.Ссылка, Выборка.Наименование);
			МассивПорядкаРецептур.Добавить(Выборка.Ссылка);	
		КонецЕсли;
		
		Если Выборка.Материал = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// фиксируем порядок как в документе
		Если МассивПорядкаКомпонентов.Найти(Выборка.Материал) = Неопределено Тогда
			МассивПорядкаКомпонентов.Добавить(Выборка.Материал);
		КонецЕсли;
		
		Если ТаблицаКомпонентов.Получить(Выборка.Материал) = Неопределено Тогда
			ТаблицаКомпонентов.Вставить(Выборка.Материал, Новый Соответствие);
		КонецЕсли;
		
		СтрокаКомпонента = ТаблицаКомпонентов[Выборка.Материал];
		Если СтрокаКомпонента.Получить(Выборка.Ссылка) = Неопределено Тогда
			СтрокаКомпонента.Вставить(Выборка.Ссылка, Выборка.КоличествоНаТонну);
		//Иначе
			//СтрокаКомпонента[Выборка.Ссылка] = СтрокаКомпонента[Выборка.Ссылка] + Выборка.КоличествоНаТонну;
		КонецЕсли;
		
	КонецЦикла;
	
	Данные = Новый Структура;
	Данные.Вставить("Рецептуры", Рецептуры);
	Данные.Вставить("Компоненты", ТаблицаКомпонентов);
	
	// Вставляем массив порядка до упаковки в ХранилищеЗначения.
	// Внимание: ХранилищеЗначения с режимом по умолчанию может не поддерживать 
	// сериализацию ссылочных типов внутри Структуры/Соответствия. 
	// Если возникнет ошибка при передаче, следует изменить режим или передавать массив отдельно.
	Данные.Вставить("ПорядокРецептур", МассивПорядкаРецептур);
	Данные.Вставить("ПорядокКомпонентов", МассивПорядкаКомпонентов);
	
	Хранилище = Новый ХранилищеЗначения(Данные);
		
	Возврат Хранилище;
	
КонецФункции

#КонецОбласти
